In [1]:
import numpy as np
import pandas as pd

In [19]:
amazon=pd.read_csv('D:/Recommendation System/Amazon/Amazon.csv')
amazon.fillna(0,inplace=True)
amazon_pd = amazon.copy()
amazon.head()

,user_id,Movie1,Movie2,Movie3,Movie4,Movie5,Movie6,Movie7,Movie8,Movie9,...,Movie197,Movie198,Movie199,Movie200,Movie201,Movie202,Movie203,Movie204,Movie205,Movie206
0,A3R5OBKS7OM2IR,5.0,5.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,AH3QC2PC1VTGP,0.0,0.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,A3LKP6WPMP9UKX,0.0,0.0,0.0,5.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,AVIY68KEPQ5ZD,0.0,0.0,0.0,5.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,A1CV1WROP5KTTW,0.0,0.0,0.0,0.0,5.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [20]:
amazon.groupby('user_id')['Movie1'].mean().sort_values(ascending=False).head()

user_id
A3R5OBKS7OM2IR    5.0
AZZ1KF8RAO1BR     0.0
A29A2OMZ3G7L9V    0.0
A29CUCGRX04TS8    0.0
A29G2JU8RWNI73    0.0
Name: Movie1, dtype: float64

In [21]:
amazon.groupby('user_id')['Movie1'].count().sort_values(ascending=False).head()

user_id
AZZ1KF8RAO1BR     1
A2995C43JA5B29    1
A29A2OMZ3G7L9V    1
A29CUCGRX04TS8    1
A29G2JU8RWNI73    1
Name: Movie1, dtype: int64

In [22]:
Amazon_filtered1 = amazon.drop(columns='user_id')
Amazon_max_views = Amazon_filtered1.sum()
Amazon_max_views

Movie1        5.0
Movie2        5.0
Movie3        2.0
Movie4       10.0
Movie5      119.0
            ...
Movie202     26.0
Movie203      3.0
Movie204     35.0
Movie205    162.0
Movie206     64.0
Length: 206, dtype: float64

In [23]:
#finding which movie has maximum views/ratings
max_views= Amazon_max_views.argmax()
max_views

126

In [24]:
#checking whether that movie has max views/ratings or not 
Amazon_max_views['Movie127']

9511.0

In [25]:
#the average rating for each movie
Average_ratings_of_every_movie=sum(Amazon_max_views)/len(Amazon_max_views.index)
Average_ratings_of_every_movie

106.44660194174757

In [26]:
Amazon_df = pd.DataFrame(Amazon_max_views)
Amazon_df.head()

            0
Movie1    5.0
Movie2    5.0
Movie3    2.0
Movie4   10.0
Movie5  119.0

# Top 5 movie ratings

In [27]:

Amazon_df.columns=['rating']
Amazon_df.nlargest(5,'rating')

          rating
Movie127  9511.0
Movie140  2794.0
Movie16   1446.0
Movie103  1241.0
Movie29   1168.0

# Top 5 movies having least audience

In [28]:

Amazon_df.nsmallest(5,'rating')

         rating
Movie45     1.0
Movie58     1.0
Movie60     1.0
Movie67     1.0
Movie69     1.0

In [29]:
melt_df=amazon_pd.melt(id_vars= amazon.columns[0],value_vars=amazon.columns[1:],var_name='Movie',value_name='rating')
melt_df

               user_id     Movie  rating
0       A3R5OBKS7OM2IR    Movie1     5.0
1        AH3QC2PC1VTGP    Movie1     0.0
2       A3LKP6WPMP9UKX    Movie1     0.0
3        AVIY68KEPQ5ZD    Movie1     0.0
4       A1CV1WROP5KTTW    Movie1     0.0
...                ...       ...     ...
998683  A1IMQ9WMFYKWH5  Movie206     5.0
998684  A1KLIKPUF5E88I  Movie206     5.0
998685   A5HG6WFZLO10D  Movie206     5.0
998686  A3UU690TWXCG1X  Movie206     5.0
998687   AI4J762YI6S06  Movie206     5.0

[998688 rows x 3 columns]